In [3]:
import pandas as pd

In [14]:
df_export =  pd.read_excel('master_ineuron.xlsm', sheet_name = ['Export_Monthly (2)', 'Export_Annual (2)'], na_values = 'NA')

In [15]:
df_export

{'Export_Monthly (2)':         Period              country  Export_merchandise
 0      1991M01            Argentina            1265.303
 1      1991M01      Developing Asia            3313.754
 2      1991M01            Australia            5502.346
 3      1991M01              Belgium                 NaN
 4      1991M01               Brazil            4896.404
 ...        ...                  ...                 ...
 17815  2018M06               Turkey           42321.980
 17816  2018M06        Taiwan, China           26755.980
 17817  2018M06               Uganda                 NaN
 17818  2018M06        United States          136749.600
 17819  2018M06  World (WBG members)         1246063.000

 [17820 rows x 3 columns],
 'Export_Annual (2)':       Year              country  Export_merchandise
 0     1991            Argentina            22191.58
 1     1991      Developing Asia                 NaN
 2     1991            Australia            80560.51
 3     1991              Belgium                 NaN
 4     1991               Brazil            53953.57
 ...    ...                  ...                 ...
 1507  2018               Turkey                 NaN
 1508  2018        Taiwan, China                 NaN
 1509  2018               Uganda                 NaN
 1510  2018        United States                 NaN
 1511  2018  World (WBG members)                 NaN

 [1512 rows x 3 columns]}

In [16]:
df_export['Export_Monthly (2)'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17820 entries, 0 to 17819
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Period              17820 non-null  object
 1   country             17820 non-null  object
 2   Export_merchandise  14131 non-null  float64
dtypes: float64(1), object(2)
memory usage: 417.8+ KB

In [17]:
df_export['Export_Monthly (2)'].isnull().sum()

Period                   0
country                  0
Export_merchandise    3689
dtype: int64

In [18]:
df_export['Export_Monthly (2)'].count()

Period                17820
country               17820
Export_merchandise    14131
dtype: int64

In [20]:
#df_export['Export_Monthly (2)'] = df_export['E'].fillna(df["Age"].mean())

### Export

##### Export annual

Export_file = pd.ExcelFile('master_ineuron.xlsm')

In [39]:
export_annual = Export_file.parse('Export_Annual (2)')

In [40]:
export_annual

      Year              country  Export_merchandise
0     1991            Argentina            22191.58
1     1991      Developing Asia                 NaN
2     1991            Australia            80560.51
3     1991              Belgium                 NaN
4     1991               Brazil            53953.57
...    ...                  ...                 ...
1507  2018               Turkey                 NaN
1508  2018        Taiwan, China                 NaN
1509  2018               Uganda                 NaN
1510  2018        United States                 NaN
1511  2018  World (WBG members)                 NaN

[1512 rows x 3 columns]

In [41]:
export_annual.count()

Year                  1512
country               1512
Export_merchandise    1144
dtype: int64

In [42]:
export_annual.isnull().sum()

Year                    0
country                 0
Export_merchandise    368
dtype: int64

In [43]:
export_annual['Export_merchandise'] = export_annual['Export_merchandise'].fillna(export_annual['Export_merchandise'].mean())

In [44]:
export_annual.isnull().sum()

Year                  0
country               0
Export_merchandise    0
dtype: int64

##### Export Monthly

In [45]:
export_monthly = Export_file.parse('Export_Monthly (2)')

In [46]:
export_monthly.count()

Period                17820
country               17820
Export_merchandise    14131
dtype: int64

In [47]:
export_monthly.isnull().sum()

Period                   0
country                  0
Export_merchandise    3689
dtype: int64

In [48]:
export_monthly['Export_merchandise'] = export_monthly['Export_merchandise'].fillna(export_monthly['Export_merchandise'].mean())

In [49]:
export_monthly.isnull().sum()

Period                0
country               0
Export_merchandise    0
dtype: int64

##### Export quaterly

In [50]:
export_qtr = Export_file.parse('Export_Quarterly')

In [51]:
export_qtr

      Period              country  Export_merchandise
0     1991Q1            Argentina            4416.531
1     1991Q1      Developing Asia                 NaN
2     1991Q1            Australia           18101.600
3     1991Q1              Belgium                 NaN
4     1991Q1               Brazil           13168.760
...      ...                  ...                 ...
5989  2018Q3               Turkey                 NaN
5990  2018Q3        Taiwan, China                 NaN
5991  2018Q3               Uganda                 NaN
5992  2018Q3        United States                 NaN
5993  2018Q3  World (WBG members)                 NaN

[5994 rows x 3 columns]

In [52]:
export_qtr.isnull().sum()

Period                   0
country                  0
Export_merchandise    1298
dtype: int64

In [54]:
export_qtr.count()

Period                5994
country               5994
Export_merchandise    4696
dtype: int64

In [55]:
export_qtr['Export_merchandise'] = export_qtr['Export_merchandise'].fillna(export_qtr['Export_merchandise'].mean())

In [56]:
export_qtr.isnull().sum()

Period                0
country               0
Export_merchandise    0
dtype: int64

### CPI

#### CPI annual

In [57]:
cpi_annual = Export_file.parse('cpi_annual (2)')

In [58]:
cpi_annual

      Year               Country        CPI
0     1989           Afghanistan        NaN
1     1989               Albania        NaN
2     1989  United Arab Emirates        NaN
3     1989               Armenia        NaN
4     1989       Developing Asia   35.24378
...    ...                   ...        ...
5155  2018   World (WBG members)  158.86920
5156  2018                 Samoa  116.73720
5157  2018           Yemen, Rep.        NaN
5158  2018          South Africa  154.65770
5159  2018                Zambia  199.27440

[5160 rows x 3 columns]

In [59]:
cpi_annual.isnull().sum()

Year         0
Country      0
CPI        910
dtype: int64

In [60]:
cpi_annual.count()

Year       5160
Country    5160
CPI        4250
dtype: int64

In [61]:
cpi_annual['CPI'] = cpi_annual['CPI'].fillna(cpi_annual['CPI'].mean())

In [62]:
cpi_annual.count()

Year       5160
Country    5160
CPI        5160
dtype: int64

##### CPI monthly

In [64]:
cpi_monthly = Export_file.parse('cpi_monthly (2)')

In [65]:
cpi_monthly.count()

year/month    58129
Country       58129
CPI           47263
dtype: int64

In [66]:
cpi_monthly.isnull().sum()

year/month        0
Country           0
CPI           10866
dtype: int64

In [67]:
cpi_monthly['CPI'] = cpi_monthly['CPI'].fillna(cpi_monthly['CPI'].mean())

In [68]:
cpi_monthly.isnull().sum()

year/month    0
Country       0
CPI           0
dtype: int64

### Exchange

#### exchange annual

In [70]:
ex_annual = Export_file.parse('Exch_annual')

In [71]:
ex_annual.count()

Period           6000
Country          6000
Exchange_rate    6000
dtype: int64

In [75]:
ex_annual

      Period               Country  Exchange_rate
0       1989           Afghanistan       0.000000
1       1989                Angola       0.000000
2       1989               Albania       0.000000
3       1989  United Arab Emirates       3.675000
4       1989              Argenti0       0.000000
...      ...                   ...            ...
5995    2018                 Samoa       2.534559
5996    2018           Yemen, Rep.     250.266400
5997    2018          South Africa      13.158120
5998    2018                Zambia      10.333910
5999    2018              Zimbabwe       0.000000

[6000 rows x 3 columns]

In [76]:
ex_monthly = Export_file.parse('Exch_monthly')

In [74]:
ex_monthly

        Period               Country  Exchange_rate
0      1988M12           Afghanistan       0.000000
1      1988M12                Angola       0.000000
2      1988M12               Albania       0.000000
3      1988M12  United Arab Emirates       3.675000
4      1988M12              Argenti0       0.000000
...        ...                   ...            ...
71995  2018M11                 Samoa       2.604273
71996  2018M11           Yemen, Rep.     250.260000
71997  2018M11          South Africa      14.183170
71998  2018M11                Zambia      11.782670
71999  2018M11              Zimbabwe       0.000000

[72000 rows x 3 columns]

### convert to excel

In [78]:
#create a dictionary for the sheet names and data{'names':value}

dfs = {'Export_annual':export_annual,'export_monthly': export_monthly, 'export_quaterly':export_qtr,
      'cpi_annual': cpi_annual, 'cpi_monthly':cpi_monthly,
       'ex_annual':ex_annual, 'ex_monthly':ex_monthly}

In [79]:
# Create a Pandas Excel writer using XlsxWriter as the engine.

writer = pd.ExcelWriter('master_inueron_cleaned.xlsx', engine='xlsxwriter')

In [81]:
# Write each dataframe to a different worksheet.
#df1.to_excel(writer, sheet_name='Sheet1')
#df2.to_excel(writer, sheet_name='Sheet2')
#df3.to_excel(writer, sheet_name='Sheet3')

for sheet_name in dfs.keys():
    dfs[sheet_name].to_excel(writer, sheet_name = sheet_name, index = False)
    
writer.save()